# RebarBendingDetailType Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarBendingDetailType Class
Members See Also
---
Type for rebar bending detail elements.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public class RebarBendingDetailType : ElementType
```

Visual Basic
---
```text
Public Class RebarBendingDetailType _
	Inherits ElementType
```

Visual C++
---
```text
public ref class RebarBendingDetailType : public ElementType
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB.Structure..::..RebarBendingDetailType
# See Also
RebarBendingDetailType Members
Autodesk.Revit.DB.Structure Namespace